Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 群山围绕，几十座浮峰高悬于空中，仙气缭绕，宛如仙境。而在浮峰的右侧不远，一座完全不同的山峰浮于众峰之上。那山比其它浮峰要小数十倍，却被一层透明的屏障包裹在里面，而浮峰的山顶上，亮着一道直达天际的光。
en_us: The sect was surrounded by floating mountains, and the numerous peaks were suspended in the sky, enclosed by a thick mist of Immortal Qi — like a scene from a fairyland. Not far from the right of the floating peaks, a completely different mountain peak floated among the other peaks. This mountain was ten times smaller than the other floating peaks, but it was enclosed in a transparent shield. On the top of this floating peak, there was a beam of light that stretched right across the horizon.

source: 群情激愤的浪潮里，突然出现了一个反对的声音，虽然声音不大，但成功引起了众妖的注意。呼喊声一停，所有妖的视线齐唰唰的刺了过去。
en_us: The objection that suddenly sounded amid the fervent demons managed to capture the attention of the demons despite being faint. The roarings came to an abrupt halt, and all the demons immediately scanned their surroundings for the perpetrator.

source: 羿清一咬牙，运起全身灵气强站了起来，挥出一剑，叮的一声，险险挡住了对方的威压中的攻击。
en_us: Yi Qing fritted his teeth. He used all the Spirit Qi he had left in his body to stand back up on his feet and wave his sword. Ding! He deflected the suppressive force that was headed toward him.

source: 羿清一急，想要过去却动弹不得，“师父，小……”
en_us: Anxious, Yi Qing tried to get up but to no avail. "Master, be care-…"

source: 羿清一惊，“原来师父与他，还有这般渊缘！”难怪孤月尊者日日来此，又不进来。原来是近乡情怯，想要与师父一叙同乡之情。
en_us: Shocked, Yi Qing said, "So he and Master actually has such an affinity!" No wonder Supremacy Lonemoon came over here everyday but did not come in. It was all because of the affection and sentiment towards his hometown that made him want to look for Master to reminisce it.

source: 羿清一惊，“师父是说……”
en_us: “Do you mean……”Shocked, Yi Qing said.

source: 羿清一惊，这人居然是——孤月！
en_us: Yi Qing started. This man is Lonemoon!

source: 羿清一愣，皱头紧了紧，这还是第一次，有人一眼看出他是天生剑体。
en_us: Yi Qing brows tightened, somewhat surprised. This was the first time someone had been able to tell that he was an Innate Sword Embodiment at one glance.

source: 羿清一愣，立马又站直了一些，一脸严肃的道，“师父放心，我一定会守好这里的。绝对不会再让任何人靠近打扰师父。”他就不信了，还有人敢在他眼皮底下抢人。
en_us: Yi Qing hesitated, immediately standing straighter, before answering seriously, "Master, rest assured. I will guard this place well. Nobody can come near to disturb Master again." He did not believe that there would be anyone who would still dare to snatch her away right under his nose.

source: 羿清一愣，脸上的愧疚越加的重，放下锅铲朝着她行了个礼，“您看出来了？果然什么事都瞒不过师父的眼睛。”
en_us: Stunned, pangs of guilt weighed Yi Qing down even more. He put down the ladle and bowed towards her, saying, "Have you seen through me? It is truly impossible to hide anything from Master."

source: 羿清一愣，顿时一脸的受伤，“徒儿不能听吗？”
en_us: Yi Qing hesitated. He looked wounded and asked, "Can't your disciple listen?"

source: 羿清一时不察，被余压扫到，瞬间气血翻涌，张口吐出一口血。
en_us: Yi Qing did not notice in time and was within range of the suppressive aura; he immediately vomited a mouthful of blood.

source: 羿清一看，对方虽只是个练气九层的年轻修士，却穿着一身三阶法衣，想必是修仙世家的公子，手里还捧着一个黑色的盒子，应该是刚刚拍到的法器。
en_us: Yi Qing took a look at this person, and realized that despite only being a young, level nine cultivator, he was wearing third stage Dharma clothing which meant that he had to be a Young Master from a family of immortal cultivators. In his hand was a black box, most probably a Dharma artifact that he had just bidded for.

source: 羿清一看，居然是极为少见的万年冰参！看来是他想多了，这种修补经脉的圣药，就算在三宗六派也是极为少有的。她居然这么随意的就拿给他疗伤！这姑娘也太良善了。
en_us: Taking a look at it, Yi Qing saw to his surprise that it was a rare ten thousand year-old Ice Ginseng! It looked like he had overthought things, for this kind of sacred herb, which could heal and restore a person's body meridians, was rare even in the Six Schools Three Sects. And yet she had given it to him to heal his injuries without a second thought! This girl was just too kind-hearted.

source: 羿清一脸期待的抬头道，“还请师父教授弟子修行。”
en_us: Yi Qing raised his head with anticipation. "Master, please impart me the ways of cultivation."

source: 羿清一脸的莫明，却还是老实的回道，“当初炼气之前，还未僻谷之时，做过一些。”
en_us: Though bewildered by her question, he nevertheless honestly replied, "I did a little cooking before I started Grain Liberation for my Qi Refinement."

source: 羿清一边击散那些诡异的气息，一边仔细思考这塔内的奥秘，花了三个时辰几乎耗尽了大半的灵力，才摸索些规律找出了四周的破绽，破开了这片黑暗，眼里顿时有了光。
en_us: As Yi Qing defended himself against the evil aura, he thought hard about the secret regarding the pagoda. After six hours, he felt low on spiritual power. He began to systematically look for cracks in the pagoda and managed to break out of the darkness. A blinding light suddenly hit his eyes.

source: 羿清不愧是专业的，短短不到二十分钟，一桌丰富的各色菜肴就摆满了一整桌，其中还包括去外门领食材的时间。道道色香味俱全，孤月突然明白，为什么沈萤说自己做的是猪食了。也不知身为剑修，他这手艺是从哪学来的。
en_us: Yi Qing was indeed professional. Within 20 minutes he had whipped up a sumptuous meal with a whole table full of different types of dishes, which even included the time he took to fetch the ingredients. Every dish smelled and tasted as great as it looked, and Lonemoon suddenly understood why Shen Ying said that his food was pig's feed. As a sword cultivator, where did he even learn how to cook?

source: 羿清不知什么时候已经应完了雷劫，飞了上来。孤月这才发现，天上的劫云已经散尽了，四下也恢复了光明，就连玄天宗的护山大阵也消失了。而羿清身上正散发着元婴的威压，特别是眉间那剑意的印痕，即使看一眼也能感觉到有剑气渗出。他果然结婴成功了，现在已经是一名元婴剑修。
en_us: Yi Qing had already completed his Lightning Tribulation and flown over. It was at that time that Lonemoon realized the tribulation clouds had dissipated, and the surroundings had also resumed its brightness. Even the Blackheaven Sect's protective mountain array had also disappeared. Yi Qing was exuding the pressure of a Nascent Soul cultivator. It could be sensed especially clearly from the sword intent scar between his brows; looking at it once was enough to feel the sword intent seeping out. He had indeed successfully completed his Nascent Soul Formation and had become a Nascent Soul sword cultivator.

source: 羿清与孤月都愣了一下，修士有灵气护体，一般很少注意四周气温的变化，“你这么一说，好像的确热了很……”
en_us: Both Yi Qing and Lonemoon were surprised at her sudden question. Cultivators, having Spirit Qi to protect their bodies, rarely paid attention to the changes in the surrounding temperature. "Now that you mentioned it, it feels really hot…"

source: 羿清也下意识的捂住了沈萤的眼睛。
en_us: Yi Qing also subconsciously covered Shen Ying's eyes.

source: 羿清也不知道自己晕了多久，只是再次醒来的时候，身上的伤已经好得差不多了。断掉的筋脉完全修复，连受损的元神都在复原。
en_us: Yi QIng did not know how long he had been unconscious, but when he woke up, he had almost recovered from his injuries, his severed meridian were completely mended, and even his damaged primordial spirit was restored.

source: 羿清也愣了一下，转身四下看了看，却发现刚刚还站在旁边的人，不见了踪影。
en_us: Yi Qing was taken aback as he turned around and looked all about him but then realized the person beside him had disappeared without a trace.

source: 羿清也是一愣，放开神识一探，果然没有对方的踪迹，“我刚刚一直有注意四周，并没有发现它逃走，一定还在这里。”
en_us: Yi Qing, who was just as baffled, used his divine perception to probe around and did not find any trace of it either. "I was scanning the surrounding area just now, and did not see it escaping, so it must still be here."

source: 羿清也没有推辞，点了点头，“责无旁贷！”
en_us: Yi Qing did not reject. He nodded and said, "It's my responsibility!"

source: 羿清习惯性的摸向身侧的储物袋，却摸了个空，身体一僵，脸色顿时白了。
en_us: Yi Qing habitually searched for his storage bag by his side, but there was nothing. He froze and his face turned white.

source: 羿清从玄天宗出来，就一路朝着西北方向而去，可能是因为心底憋着几分气，飞得又快又急。一路离开了玄海，才回过头来。
en_us: Yi Qing headed north-west the moment he stepped out of Blackheaven Sect. He flew especially fast — perhaps because he was still indignant inside. He had already flown past the Black Sea before he finally turned around.

source: 羿清伸手指了指右边，“往南而行即可。”
en_us: Yi Qing stretched his hand and pointed to the right, "Just heading south will do."

source: 羿清僵了一下，“……萝卜！”
en_us: Yi Qing hesitated and replied, "Radish!"

source: 羿清再次醒来的时候，发现他还是躺在那个院子里，连位置都没动一下。伤势太重，视线不清，他只能隐隐看到一灰一白两个影子在说着什么，那白影极大，隐隐还散发着妖气。
en_us: When Yi Qing next awoke, he found that he was still lying in that courtyard, in the same exact position he was at before. Due to the severity of his injuries and his blurry vision, he could only vaguely see the shadowy outlines of two figures, one gray and one white, and both seemed to be talking. The white figure, which was huge, exuded a faint demonic aura.

source: 羿清到口的解释又吞了回去，嗯，一定是师父想保持低调。
en_us: An explanation had been on the tip of Yi Qing's tongue, but he swallowed down. Yes, Master must want to maintain a low profile.

source: 羿清剑一停，条件反射回身一剑劈开那法器，阵中的魔修却突然破阵而出，一掌打向他的胸前，虽没有击中，却直接抓走了什么。
en_us: Yi Qing's sword paused and his basic reflex was to go backwards and avoid the Dharma artifact. But all of a sudden, the fiendish cultivator broke the sword array and attacked precisely at his chest with a palm. Although he missed, he seemed to have grabbed something away.

source: 羿清剑招一换，一剑劈开了那团黑气，周身的灵剑，飞驰而出，刷啦啦朝着魔修遁逃的方向追了出去，瞬间就在对方周围结下了剑阵，直接把人困在中间。
en_us: Yi Qing switched to another sword technique and used it to cut right through the black smoke, and then the spiritual swords surrounding him charged toward the direction that the fiendish cultivator went in. Being surrounded by the sword array, he was trapped in the middle.

source: 羿清却已经带着人，火急火燎的出殿去了，远远的还能听到两人的对话声。
en_us: However, Yi Qing’s group was already rushing out of the hall with the disciple. Though they were some distance away, the gist of their conversation could still be heard.

source: 羿清却突然回身，手中的剑顺势一挥，顿时一条剑气形成的龙，带着惊人的气势瞬间就朝着她冲了过来。
en_us: Yi Qin whipped around. With a wave of his sword, he turned his sword intent into a dragon which charged towards her with great ferocity.

source: 羿清只好转头看向萝卜，“萝卜你刚……”
en_us: Yi Qing turned to look at the radish and said, "Radish, you..."

source: 羿清只得把人往后一推，离开危险范围，交待道，“待在后面，不要离开我师父身边。”
en_us: Yi Qing shoved him further back, out of the danger zone, and instructed, "Stay behind, do not leave my Master's side."

source: 羿清只觉得气血翻涌，脚下一沉，张嘴就吐出一口血，连着金丹都隐隐有炸裂的趋势。而那边的姓陆的修士，已经直接被叫声中的气息震得趴在了地上。
en_us: Yi Qing felt his blood and Qi surging, then his feet buckled and he spit out a mouthful of blood. Even the Golden Core in his body seemed on the verge of exploding. And over on the other side, the cultivator named Lu lay flat on the ground, felled by the impact of the sound.

source: 羿清和孤月与其说一路追着狐妖，不如说是追着沈萤而去，因为她那一骑绝尘实在是太明显了。直到一路跟到了一个山洞门口才停了下来。
en_us: Yi Qing and Lonemoon were not so much pursuing the fox demon as pursuing Shen Ying, who had left them trailing far behind. They followed her right up to the entrance of a cave before stopping.

source: 羿清和孤月也在这时追了进来，孤月还好，到是羿清身上多了几道伤痕。
en_us: Yi Qing and Lonemoon had also caught up by then. Lonemoon was fine but Yi Qing had several wounds on his body.

source: 羿清和孤月已经在这片灵气稀薄的林子找了好几天了，他们一路寻着魔修的气息而来，明明好几次都感应到了位置，偏偏就是找不着人。整个林子转了好几遍，一无所获，孤月都要怀疑是不是那魔修故意布下的疑阵了。
en_us: Yi Qing and Lonemoon had already been searching for a few days in that forest which had very faint traces of Spirit Qi, pursuing the trail of the fiendish cultivator. Although they had clearly sensed the location of their target on several occasions, they just could not seem to find the person. They had gone through the entire forest many times to no avail, and Lonemoon even suspected whether the fiendish cultivator had purposely set up a misdirection array.

source: 羿清和孤月带着三个家主，边打边退，塔中不知岁月，也不知道过了多久。他们才慢慢找了机会调息了过来。但三位家主却伤得太重，他们出手叫醒的时候受的伤到是其次，主要是他们沉迷心魔太久，已经伤到了根基。全身的灵气更是散得七七八八的。更奇怪的是，这塔内，居然不能引气入体。
en_us: Yi Qing and Lonemoon, with the three patriarchs in tow, fought off their attackers as they retreated. Time passed. They did not know how long they had been in the pagoda. Finally, they found the chance to regulate their meridians. However, the three family patriarchs were in a bad way, partly due to the injuries they received when they were awakened, but mainly because they had been trapped for too long within the Mental Demon Tribulations spell, causing their their foundations to be damaged. The Spirit Qi in their entire body had almost all dissipated. The strange thing was they could not even draw Qi into their bodies.

source: 羿清和孤月这才一脸淡定的收回了——踹出的腿。
en_us: Yi Qing and Lonemoon calmly each of their legs.

source: 羿清嘴角抽了抽，孤月却当机立断，毫不犹豫的伸手指向右边山上。
en_us: The corner of Yi Qing's mouth twisted. Lonemoon took this chance and pointed to the hill to his right without hesitation.

source: 羿清回头看了他一眼，眉头一皱，猛的又转了回去，仿佛没听见他刚刚的话一样，继续满眼星星的看着沈萤，
en_us: Turning his head to look at Lonemoon, Yi Qing frowned and immediately turned back again, as if he had not heard anything, continuing to look at Shen Ying with a star-gazed expression in his eyes.

source: 羿清好似对这种事，很有经验，在街上打听了一会，就带着她朝着城中最高的一栋楼走去。待到掌事面前，抱拳道，“这位道友，听闻这里需要护卫。”
en_us: Yi Qing seemed to have a lot of experience in this matter. After asking around in the city for a while, he brought her towards the tallest building in the city. He cupped his fists before the steward and said, "Fellow Daoist, I heard that this place needs some protection."

source: 羿清带着人进了城，穿过热闹的街道，一路朝着最中心的地方而去。直到来到人最多的一处小广场上，才停了下来。这里人很多，有三五成群的，也有独行的，一个个仙风道骨的，排成了长队，似是在等待着什么。
en_us: Yi Qing brought her into the city, cutting a path through the bustling streets towards the central area. They only stopped after they reached the most crowded area that was a small public square. There were many people there; some were in groups while others were traveling alone. All of them were sage-like, standing in the line of a long queue, seemingly waiting for something.

source: 羿清带着沈萤排在了队伍的最后面，指了指前面道，“师父，传送阵就在前面，一会我们就可以到玄天宗。”
en_us: Yi Qing brought Shen Ying to stand in line at the very end of the queue. He pointed to the front and said, "Master, the transportation array is right in front. We will be able to reach Blackheaven Sect in a while."

source: 羿清很想回答她，但身上实在是太痛了，经筋修复的痛苦不是常人可以忍受的，再加上他的修为被妖气压制，不能封闭五感，更是痛苦万分，撑不到十息，再次晕了过去。
en_us: Yi Qing wanted very much to answer her, but his body was hurting too much. The pain from the rejuvenation of his body’s meridians was not something that a normal person could bear. Moreover, he was unable to block out his five senses, which had been suppressed by demon aura, and this greatly increased his suffering. After holding out for ten breaths, he finally fainted.

source: 羿清心下一紧，早看出噬魂幡有生出鬼王的趋势，所以他才急着送上玄天宗，没想到偏偏是在这个时候。想必是刚刚魔修放出的阴气，加速了它的成长。
en_us: Yi Qing tensed up at the sight. He had known all along that the Soul Devouring Gonfalon would eventually give birth to the Ghost King, which was why he had wanted it delivered urgently to the Blackheaven Sect. However, he had not expected that it would choose now, of all times, to give birth. Its rapid growth had likely been aided by the Yin Qi emanating from the fiendish cultivator.

source: 羿清心头一梗，觉得一股郁气堵在了心口，顿时看门口那个身影就有些不顺眼起来，他这才刚拜师，就有人眼红了。
en_us: Yi Qing's heart wrenched at the thought and felt stuffiness in his chest. The figure by the door immediately became an eye sore; he had only just managed to become her disciple yet people were already being envious.

source: 羿清心底顿时涌上一股不能自己的激动，就连许久没有动静的剑心，都在兴奋的颤动着。这是一个高人，一个让人根本探不到底的高人。
en_us: Yi Qing's heart immediately began to stir with excitement, and even his Heart of the Sword that had been quiet for so long quivered with excitement. This was an expert, one that nobody could even fathom any understanding of.

source: 羿清心里一暖，连忙抱拳行礼，“多谢前辈，不过我的经脉已经修复，用不上这个。”
en_us: Yi Qing's heart was warmed and he then immediately saluted her with cupped fists, "Thank you Senior, but my meridians have already been recuperated, I do not need this."

source: 羿清快步进屋察看了一圈，没有找着人，转身走向沾满了鲜血的石桌，捏了一个诀顿时整个石桌大亮，空中慢慢出现了影像，正是半个时辰前的情景。
en_us: Yi Qing quickly searched around the house but did not find her. Turning around, he walked towards the blood-stained stone table and formed a hand seal. Immediately, the entire stone table lit up brightly and an image slowly appeared. This was the scene that had taken place an hour ago.

source: 羿清想了想，半会才认真的回答道，“可能是因为……师父还没灭了它全族吧？”
en_us: Yi Qing thought about this for a while and then replied earnestly, "Probably because… Master has not destroyed its whole clan yet?"

source: 羿清想了想，接着问道，“我二人，一人两块下品灵石吗？”
en_us: Yi Qing contemplated for a moment, and then asked, "There's two of us, so what about two pieces each?"

source: 羿清愣了一下，就连追上来的孤月也是一愣，没想到这只狐妖这么豁得出去。
en_us: For a moment Yi Qing stood stunned, as did Lonemoon who had just caught up. They had not expected this fox demon to go all out.

source: 羿清愣了一下，怎么觉得这道理哪怪怪的？却没再继续追问，反而转身朝着对方恭敬的行了个礼，“在下羿清，多谢姑娘的救命之恩。”
en_us: For a while, Yi Qing felt perplexed. Why did he feel that there was something wrong with this reasoning? But he did not pursue it further, turning instead to face her. Bowing respectfully, he said, "I'm Yi Qing. Thank you for saving my life."

source: 羿清把沈萤送回了迎缘峰，瞅了瞅天色道，“快中午了，师父您稍等，我去领下今天的食材，马上就回来。”
en_us: Yi Qing brought Shen Ying back to Yingyuan Peak, looked at the sky and said, "It's almost noon. Master, please wait for a while, I will go pick up the ingredients for today and be back soon."

source: 羿清拼命调动灵气抵御，刚布下防御的结界。又是一道鬼叫响起，他再次吐出一口血，跪了下去，结界倾刻碎裂，全身沉如千斤，鬼王的威压之下，再不能动弹。
en_us: Yi Qing desperately mobilized his Spirit Qi to create a defensive barrier. Just as it was completed, there was another ghostly cry. He vomited blood again and fell to his knees. The barrier was instantly torn apart. His whole body felt unbearably heavy. Utterly overcome by the formidable power of the Ghost King, he lay motionless.

source: 羿清整个人都震惊了，妖又不是异兽，与人素来对立，怎么会甘愿被人驱使。
en_us: Yi Qing was taken aback. The demons were not just any creatures; they had always been on opposing sides from the humans, so how could they be willing to be ordered about by a human?

source: 羿清是昨晚赶到郁家的，那升仙塔高耸入云，共有三层，四周围绕着浓郁的仙气，比起上次那个上古仙宫中看到的更加浓郁。奇怪的是这么一座仙塔，郁家居然没有派人在前方镇守，任由修士进入。
en_us: Yi Qing rushed to the Yu Family the night before. The Immortal Ascension Pagoda was so tall that it reached the skies. Immortal Qi thicker than in the the ancient Immortal Pavilion surrounded the pagoda. What was strange was that the Yu Family did not send anyone to guard the entrance to such a great Immortal Ascension Pagoda. Cultivators were free to enter.

source: 羿清有点懵，这是……妖？说好的妖性本恶，见人就吃呢？
en_us: Yi Qing was a little confused — these were… demons? What about the known fact that the nature of demons was evil and that they would eat every human they came across?

source: 羿清本身就是身体素质过硬的剑修，虽然体内妖气未清，不能使用术法，但填几个坑对他来说不在话下。不到一会，他已经把院里所有的坑都填上了，包括沈萤挖的那个近两米的深坑。
en_us: Yi Qing's overly strong body constitution was exactly what defined the sword cultivator. Although the demonic aura in his body was not completely removed yet and he could not wield his sorcery, filling up the pit was definitely within his capabilities. Within a short period of time, he filled up all the holes in the entire yard, including the almost two-meter deep hole that Shen Ying had dug.

source: 羿清沉默了整整一分钟，才一脸复杂的飞了回来，犹豫的朝她伸出手道，“那……我可否载师父一程？”
en_us: Yi Qing was silent for a full minute before flying back with complicated emotions. He hesitated, then stretched his hand out towards her, "Then… May I give Master a ride?"

source: 羿清没有再问，唤出了飞剑，想了想又伸手把沈萤拉回自己的剑上，这才御剑而起，朝着曲双城而去。
en_us: Yi Qing did not probe further and summoned his sword. He thought for a while before reaching out to pull Shen Ying back on his sword, rode his sword towards Qushuang City.

source: 羿清没有回，而是忍着筋脉被妖气一寸寸切断的疼痛，生生的把手上的阵法结印完全。直到阵法成形，压住了旗面上那不断涌动的黑气，才停了下来，身子一歪，再次倒在了地上。
en_us: Yi Qing did not answer as he was enduring the great pain caused by his meridians being gradually severed by the demonic aura. He forced himself to complete the array formation imprint in his hand, stopping only after the array formation had taken shape and suppressed the swirls of black Qi on the flag. His body started to sway and he once again collapsed onto the floor.

source: 羿清没有继续再问，抬头看了看天空道，“那阶梯又出现了。”
en_us: Yi Qing stopped pushing him further. He raised his head to look at the sky and said, "There, the flight of stairs again."

source: 羿清没有迟疑直接御剑带她飞了起来，越飞越高，直飞到离地数千米的高空，她这才指向下方，对跟着一起飞上来的薄飞平和孤月道。
en_us: Without hesitation, Yi Qing immediately whipped out his sword and rode it with her. They flew higher and higher till they were a few thousand meters away from the ground. She then pointed below and told Pu Feiping and Lonemoon who flew up together.

source: 羿清满心的疑问，却见沈萤已经淡定的撸起袖子，打算前去帮忙了。
en_us: Yi Qing was filled with questions, but he saw that Shen Ying was already calmly folding up her sleeves and ready to help out.

source: 羿清点了点头回应。
en_us: Yi Qing nodded in response.

source: 羿清点了点头，“我也牛尊者自有打算。”
en_us: Yi Qing nodded in agreement. "I also thought Supremacy Niu had plans."

source: 羿清点了点头，他现在也算是玄天宗门人，门派出事，他自然要去看看。于是向沈萤打了声招呼，就随奚秋飞向了右侧一座溢满丹香的浮峰。
en_us: Yi Qing nodded. He was also considered to be under the Blackheaven Sect, so when something happened, he certainly should go and take a look. Hence, after bidding goodbye to Shen Ying, he followed Xi Qiu and flew towards the floating peak filled with the scents of elixirs towards the right.

source: 羿清点了点头，四周的灵剑一转，挡开血狐的攻击，剑峰直接朝着妖狐脚下攻去。
en_us: Yi Qing nodded, directing the spirit swords around him to fend off the blood fox’s attack while directly attacking the feet of the fox with the tip of his sword.

source: 羿清点了点头，回了个礼道，“还得多谢城主当日赐宝。”
en_us: Yi Qing nodded and said, "This is all thanks to you for giving me the precious mirror that day."

source: 羿清点了点头，带着年轻人一起出了门。到是对方很是客气，兴许是惊讶于有金丹修士相送，一路都显得有些兴奋，一边说着自己如何拍到手里的宝贝，一边往城西走去。
en_us: Yi Qing nodded as he brought the young man out. The man was rather polite; perhaps due to the surprise of being escorted by a Golden Core cultivator, he seemed really excited the entire journey. He continued to talk about how he had managed to bid for the treasure in his hand as they walked towards the west of the city.

source: 羿清点头，“这里的阴气还未完全散尽，魔修离开应该不到半柱香时间，也就是说……”
en_us: Yi Qing nodded. "The Yin Qi has not dissipated completely. The fiendish cultivator must not have left here for more than half an incent stick's time, which also means…"

source: 羿清犹豫了一会，才继续问道，“徒儿有件事，想问师父。”
en_us: Yi Qing hesitated for a while before asking, "I have a matter to consult with Master."

source: 羿清犹豫的皱了皱眉。
en_us: Yi Qing frowned uncertainly.

source: 羿清甩了甩头，扔开这种荒谬的想法，带着人再次御剑而起。师父这么厉害，怎么可能不会御剑？一定有别的原因。莫非是因为昨晚为他驱除妖气时，受了什么内伤？以免他担心才没有告诉他？
en_us: Yi Qing shook his head and tossed this absurd thought away, and once again resumed sword-riding with a passenger. Master being so formidable, how could she not know sword-riding? There had to be another reason. Could it be that when she helped him eliminate the demonic aura last night, she sustained some internal injuries? Was she afraid that he would be worried and so was keeping it from him?

source: 羿清的剑先一步飞了出去，直接截住了血狐逃跑的方法。
en_us: Yi Qing was the first to fly out on his sword, directly preventing the blood fox from escaping.

source: 羿清的剑招毫不留情，仿佛对面站的不是同伴，而是仇人一般。哪疼往哪打，而对面的孤月，全程一声不吭，像个没知觉的木偶一般，根本不知道防守，只全力攻击着羿清。
en_us: Yi Qing did not hold back his sword techniques. From the way he was fighting, one would think that his opponent was his nemesis and not his companion. He hit Lonemoon everywhere, yet Lonemoon did not seem to feel any pain. He did not try to defend himself, but went all out to attack Yi Qing.

source: 羿清的心更凉了，一个妖王就已经要拼命了，一群……
en_us: Yi Qing's heart sunk. One Demon Monarch had already forced him to bring out all his might, yet a whole group…

source: 羿清的眉头却打起了结，“抱歉，在下已有师门。”
en_us: Yi Qing, however, began to frown. "I'm sorry, I already have a master."

source: 羿清皱了皱眉，扫视了四周一圈，直到没发现要找的人，才握紧手里的剑，直接往着那阶梯飞了上去，不管这塔内有什么，只有闯了才知道。
en_us: Yi Qing frowned. He scanned his surroundings, but didn't see anyone else who was conscious. He tightened his grip on his sword and flew up the flight of stairs. He wasn't afraid of what he would find in the pagoda, all he knew was that he would never find out was there if he refused to move.
